

# Задание 2
# Напишите функцию, которая принимает два числа
# в качестве параметра и отображает все нечетные числа
# между ними. *


# def num(a, b):
#     for i in range(a, b+1):
#         if i % 2 != 0:
#             print(i)
#
#
# num(1, 20)


# Задание 3
# Напишите функцию, которая отображает горизонтальную или вертикальную линию из некоторого символа.
# Функция принимает в качестве параметра: длину линии,
# направление, символ.  -


# def line():


# Задание 4
# Напишите функцию, которая возвращает максимальное из четырёх чисел. Числа передаются в качестве
# параметров. *


# def maximum(a, b, c, d):
#     return max(a, b, c, d)
#
#
# res = maximum(5, 8, 10, 15)
# print(res)


# Задание 5
# Напишите функцию, которая возвращает сумму чисел
# в указанном диапазоне. Границы диапазона передаются
# в качестве параметров.*


# def summa():
#     n = int(input('Введите число а: '))
#     m = int(input('Введите число b: '))
#     s = sum(range(n, m))
#     print(s)
#
#
# summa()


# Задание 6
# Напишите функцию, которая проверяет является ли
# число простым. Число передаётся в качестве параметра.
# Если число простое нужно вернуть из метода true, иначе
# false.*

# def pr():
#     a = int(input("Введите число: "))
#     k = 0
#     for i in range(2, a // 2 + 1):
#         if a % i == 0:
#             k += 1
#     if k <= 0:
#         print("Число простое")
#     else:
#         print("Число не является простым")
#
#
# pr()

